Revit 2026 API

# ViewDuplicateOption Enumeration

---

Options for duplicating views

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ViewDuplicateOption
```
```vb
Public Enumeration ViewDuplicateOption
```
```cpp
public enum class ViewDuplicateOption
```
```fsharp
type ViewDuplicateOption
```

| Member name | Value | Description |
| --- | --- | --- |
| AsDependent | 1 | Duplicate as Dependent |
| Duplicate | 0 | Duplicate view |
| WithDetailing | 2 | Duplicate with Detailing |

#### Reference

Autodesk.Revit.DB Namespace